# -*- coding: utf-8 -*-
"""
Spyder Editor

This is a temporary script file.
"""

print("姓名:%s, 零用錢有:%d" % ("Bill",1000))
print("利率:%f" % (3.14)) #%f保留六個小數點
print("利率:%.2f" % (3.1415926))

print("姓名:%10s。" % ("Bill")) #靠右對齊
print("姓名:%-10s。" % ("Bill")) #靠左對齊
print("存款:%6d" % (1000))
print("存款:%5.1f" % (3.14))

print("姓名:{},存款:{},銀行利率:{}".format("David", 100000, 3.14))
print("電腦補習班：{0}, 人數有:{1},招生高是:{0}".format("聯成",100))

print("現金有:{:,}, 利率:{:.2f}".format(100000,3.1415))
print("人數有:{1:3d}, 位置在:{0:10s}, 分數為:{1:3d}".format("一中街",96))
print("人數有:{1:3d}, 位置在:{0:<10s}, 分數為:{1:3d}".format("一中街",96)) #<為靠左對齊
print("人數有:{1:3d}, 位置在:{0:>10s}, 分數為:{1:3d}".format("一中街",96)) #>為靠右對齊
print("人數有:{1:3d}, 位置在:{0:^10s}, 分數為:{1:3d}".format("一中街",96)) #^為置中對齊

print("人數有:{1:0>5d}, 位置在:{0:^10s}, 分數為:{1:3d}".format("一中街",96))
print("人數有:{1:+<5d}, 位置在:{0:^10s}, 分數為:{1:3d}".format("一中街",96))